#### Terraform Format 🖌 `failure`
#### Terraform Init ⚙️ `success`
#### Terraform Validate 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.dynamodb_billing_enforcer[0].data.archive_file.enforcer_lambda: Reading...
module.dynamodb_billing_enforcer[0].data.archive_file.enforcer_lambda: Read complete after 0s [id=f376f1c2968b21f6d2558489c4bd7d1a58c683a3]
module.scp_manager.aws_organizations_policy_attachment.cost_avoidance: Refreshing state... [id=ou-2laj-sre4rnjs:p-ozmh7axs]
module.service_quotas.aws_servicequotas_template.alb_count["us-west-2"]: Refreshing state... [id=us-west-2,L-53DA6B97,elasticloadbalancing]
module.cost_anomaly_detection[0].aws_sns_topic.cost_anomaly_alerts[0]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts]
module.service_quotas.aws_servicequotas_template.ebs_snapshots["us-east-1"]: Refreshing state... [id=us-east-1,L-309BACF6,ebs]
module.service_quotas.aws_servicequotas_template.alb_count["us-east-1"]: Refreshing state... [id=us-east-1,L-53DA6B97,elasticloadbalancing]
module.scp_manager.aws_organizations_policy.cost_avoidance: Refreshing state... [id=p-ozmh7axs]
data.aws_organizations_organizational_unit_descendant_accounts.sandbox_pool[0]: Reading...
module.service_quotas.aws_servicequotas_template.ebs_snapshots["us-west-2"]: Refreshing state... [id=us-west-2,L-309BACF6,ebs]
module.budgets[0].aws_sns_topic.budget_alerts[0]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts]
module.scp_manager.aws_organizations_policy.restrictions: Refreshing state... [id=p-6tw8eixp]
module.service_quotas.aws_servicequotas_template.ec2_dl_vcpus["us-east-1"]: Refreshing state... [id=us-east-1,L-6E869C2A,ec2]
module.service_quotas.aws_servicequotas_template.lambda_concurrent_executions["us-east-1"]: Refreshing state... [id=us-east-1,L-B99A9384,lambda]
module.service_quotas.aws_servicequotas_template.lambda_concurrent_executions["us-west-2"]: Refreshing state... [id=us-west-2,L-B99A9384,lambda]
module.service_quotas.aws_servicequotas_template.ec2_dl_vcpus["us-west-2"]: Refreshing state... [id=us-west-2,L-6E869C2A,ec2]
module.cost_anomaly_detection[0].aws_ce_anomaly_monitor.linked_accounts[0]: Refreshing state... [id=arn:aws:ce::955063685555:anomalymonitor/6bc1d6c1-9ce8-4792-af26-0b4e85228b1c]
module.dynamodb_billing_enforcer[0].aws_cloudwatch_event_rule.dynamodb_table_changes: Refreshing state... [id=ndx-dynamodb-billing-enforcer]
module.service_quotas.aws_servicequotas_template_association.sandbox[0]: Refreshing state... [id=955063685555]
module.scp_manager.aws_organizations_policy.nuke_supported_services: Refreshing state... [id=p-7pd0szg9]
module.service_quotas.aws_servicequotas_template.ec2_spot_vcpus["us-east-1"]: Refreshing state... [id=us-east-1,L-34B43A08,ec2]
module.service_quotas.aws_servicequotas_template.ec2_spot_vcpus["us-west-2"]: Refreshing state... [id=us-west-2,L-34B43A08,ec2]
module.cost_anomaly_detection[0].data.aws_caller_identity.current: Reading...
data.aws_organizations_organizational_unit_descendant_accounts.sandbox_pool[0]: Read complete after 1s [id=ou-2laj-sre4rnjs]
module.dynamodb_billing_enforcer[0].aws_iam_role.enforcer_lambda: Refreshing state... [id=ndx-dynamodb-billing-enforcer]
module.budgets[0].aws_iam_role.budget_actions[0]: Refreshing state... [id=ndx-sandbox-budget-actions]
module.service_quotas.aws_servicequotas_template.nat_gateways["us-east-1"]: Refreshing state... [id=us-east-1,L-FE5A380F,vpc]
module.cost_anomaly_detection[0].data.aws_caller_identity.current: Read complete after 0s [id=955063685555]
module.service_quotas.aws_servicequotas_template.nat_gateways["us-west-2"]: Refreshing state... [id=us-west-2,L-FE5A380F,vpc]
module.cost_anomaly_detection[0].aws_sns_topic_subscription.email[2]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts:6aa4a142-c55b-4842-b027-33445a05fa86]
module.cost_anomaly_detection[0].aws_sns_topic_subscription.email[1]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts:9d1f7fcc-5914-45ee-88c5-0e7e9da7f6e0]
module.cost_anomaly_detection[0].aws_sns_topic_subscription.email[0]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts:c292863b-a7ea-48bc-8d25-295fde17c607]
module.budgets[0].aws_sns_topic_policy.budget_alerts[0]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts]
module.cost_anomaly_detection[0].aws_sns_topic_policy.cost_anomaly_alerts[0]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["404584456509"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-404584456509]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["982203978489"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-982203978489]
module.budgets[0].aws_budgets_budget.service["s3"]: Refreshing state... [id=955063685555:ndx-sandbox-s3-daily]
module.budgets[0].aws_budgets_budget.service["stepfunctions"]: Refreshing state... [id=955063685555:ndx-sandbox-stepfunctions-daily]
module.budgets[0].aws_budgets_budget.service["cloudwatch"]: Refreshing state... [id=955063685555:ndx-sandbox-cloudwatch-daily]
module.budgets[0].aws_budgets_budget.service["bedrock"]: Refreshing state... [id=955063685555:ndx-sandbox-bedrock-daily]
module.budgets[0].aws_budgets_budget.service["ec2"]: Refreshing state... [id=955063685555:ndx-sandbox-ec2-daily]
module.budgets[0].aws_budgets_budget.service["rds"]: Refreshing state... [id=955063685555:ndx-sandbox-rds-daily]
module.budgets[0].aws_budgets_budget.service["apigateway"]: Refreshing state... [id=955063685555:ndx-sandbox-apigateway-daily]
module.budgets[0].aws_budgets_budget.service["lambda"]: Refreshing state... [id=955063685555:ndx-sandbox-lambda-daily]
module.budgets[0].aws_budgets_budget.service["dynamodb"]: Refreshing state... [id=955063685555:ndx-sandbox-dynamodb-daily]
module.budgets[0].aws_budgets_budget.service["data_transfer"]: Refreshing state... [id=955063685555:ndx-sandbox-data-transfer-daily]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["404584456509"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-404584456509]
module.scp_manager.aws_organizations_policy_attachment.nuke_supported_services: Refreshing state... [id=ou-2laj-4dyae1oa:p-7pd0szg9]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["982203978489"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-982203978489]
module.budgets[0].aws_iam_role_policy.budget_actions[0]: Refreshing state... [id=ndx-sandbox-budget-actions:ndx-sandbox-budget-actions-policy]
module.dynamodb_billing_enforcer[0].aws_iam_role_policy.enforcer_lambda: Refreshing state... [id=ndx-dynamodb-billing-enforcer:ndx-dynamodb-billing-enforcer-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.budgets[0].aws_budgets_budget.daily_cost_per_account["982203978489"] will be destroyed
  # (because key ["982203978489"] is not in for_each map)
  - resource "aws_budgets_budget" "daily_cost_per_account" {
      - account_id        = "955063685555" -> null
      - arn               = "arn:aws:budgets::955063685555:budget/ndx-sandbox-daily-982203978489" -> null
      - budget_type       = "COST" -> null
      - id                = "955063685555:ndx-sandbox-daily-982203978489" -> null
      - limit_amount      = "50.0" -> null
      - limit_unit        = "USD" -> null
      - name              = "ndx-sandbox-daily-982203978489" -> null
      - tags              = {
          - "Component"        = "Budget-Guardrails"
          - "SandboxAccountId" = "982203978489"
        } -> null
      - tags_all          = {
          - "Component"        = "Budget-Guardrails"
          - "Environment"      = "production"
          - "ManagedBy"        = "Terraform"
          - "Project"          = "NDX"
          - "Repository"       = "terraform-scp-overrides"
          - "SandboxAccountId" = "982203978489"
        } -> null
      - time_period_end   = "2087-06-15_00:00" -> null
      - time_period_start = "2026-01-15_00:00" -> null
      - time_unit         = "DAILY" -> null

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "982203978489",
            ] -> null
        }

      - cost_types {
          - include_credit             = false -> null
          - include_discount           = true -> null
          - include_other_subscription = true -> null
          - include_recurring          = true -> null
          - include_refund             = false -> null
          - include_subscription       = true -> null
          - include_support            = true -> null
          - include_tax                = true -> null
          - include_upfront            = true -> null
          - use_amortized              = false -> null
          - use_blended                = false -> null
        }

      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-xxxxx@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [
              - "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ] -> null
          - threshold                  = 100 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-xxxxx@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [
              - "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ] -> null
          - threshold                  = 10 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-xxxxx@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [
              - "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ] -> null
          - threshold                  = 50 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
    }

  # module.budgets[0].aws_budgets_budget.monthly_cost_per_account["982203978489"] will be destroyed
  # (because key ["982203978489"] is not in for_each map)
  - resource "aws_budgets_budget" "monthly_cost_per_account" {
      - account_id        = "955063685555" -> null
      - arn               = "arn:aws:budgets::955063685555:budget/ndx-sandbox-monthly-982203978489" -> null
      - budget_type       = "COST" -> null
      - id                = "955063685555:ndx-sandbox-monthly-982203978489" -> null
      - limit_amount      = "1000.0" -> null
      - limit_unit        = "USD" -> null
      - name              = "ndx-sandbox-monthly-982203978489" -> null
      - tags              = {
          - "Component"        = "Budget-Guardrails"
          - "SandboxAccountId" = "982203978489"
        } -> null
      - tags_all          = {
          - "Component"        = "Budget-Guardrails"
          - "Environment"      = "production"
          - "ManagedBy"        = "Terraform"
          - "Project"          = "NDX"
          - "Repository"       = "terraform-scp-overrides"
          - "SandboxAccountId" = "982203978489"
        } -> null
      - time_period_end   = "2087-06-15_00:00" -> null
      - time_period_start = "2026-01-01_00:00" -> null
      - time_unit         = "MONTHLY" -> null

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "982203978489",
            ] -> null
        }

      - cost_types {
          - include_credit             = false -> null
          - include_discount           = true -> null
          - include_other_subscription = true -> null
          - include_recurring          = true -> null
          - include_refund             = false -> null
          - include_subscription       = true -> null
          - include_support            = true -> null
          - include_tax                = true -> null
          - include_upfront            = true -> null
          - use_amortized              = false -> null
          - use_blended                = false -> null
        }

      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-xxxxx@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [
              - "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ] -> null
          - threshold                  = 100 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-xxxxx@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [
              - "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ] -> null
          - threshold                  = 85 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "FORECASTED" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-xxxxx@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [
              - "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts",
            ] -> null
          - threshold                  = 100 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
    }

  # module.budgets[0].aws_budgets_budget.service["apigateway"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-apigateway-daily"
        name              = "ndx-sandbox-apigateway-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "404584456509",
              - "982203978489",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "404584456509",
            ]
        }

        # (4 unchanged blocks hidden)
    }

  # module.budgets[0].aws_budgets_budget.service["bedrock"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-bedrock-daily"
        name              = "ndx-sandbox-bedrock-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "404584456509",
              - "982203978489",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "404584456509",
            ]
        }

        # (5 unchanged blocks hidden)
    }

  # module.budgets[0].aws_budgets_budget.service["cloudwatch"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-cloudwatch-daily"
        name              = "ndx-sandbox-cloudwatch-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "404584456509",
              - "982203978489",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "404584456509",
            ]
        }

        # (5 unchanged blocks hidden)
    }

  # module.budgets[0].aws_budgets_budget.service["data_transfer"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-data-transfer-daily"
        name              = "ndx-sandbox-data-transfer-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "404584456509",
              - "982203978489",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "404584456509",
            ]
        }

        # (4 unchanged blocks hidden)
    }

  # module.budgets[0].aws_budgets_budget.service["dynamodb"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-dynamodb-daily"
        name              = "ndx-sandbox-dynamodb-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "404584456509",
              - "982203978489",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "404584456509",
            ]
        }

        # (4 unchanged blocks hidden)
    }

  # module.budgets[0].aws_budgets_budget.service["ec2"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-ec2-daily"
        name              = "ndx-sandbox-ec2-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "404584456509",
              - "982203978489",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "404584456509",
            ]
        }

        # (4 unchanged blocks hidden)
    }

  # module.budgets[0].aws_budgets_budget.service["lambda"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-lambda-daily"
        name              = "ndx-sandbox-lambda-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "404584456509",
              - "982203978489",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "404584456509",
            ]
        }

        # (4 unchanged blocks hidden)
    }

  # module.budgets[0].aws_budgets_budget.service["rds"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-rds-daily"
        name              = "ndx-sandbox-rds-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "404584456509",
              - "982203978489",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "404584456509",
            ]
        }

        # (4 unchanged blocks hidden)
    }

  # module.budgets[0].aws_budgets_budget.service["s3"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-s3-daily"
        name              = "ndx-sandbox-s3-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "404584456509",
              - "982203978489",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "404584456509",
            ]
        }

        # (4 unchanged blocks hidden)
    }

  # module.budgets[0].aws_budgets_budget.service["stepfunctions"] will be updated in-place
  ~ resource "aws_budgets_budget" "service" {
        id                = "955063685555:ndx-sandbox-stepfunctions-daily"
        name              = "ndx-sandbox-stepfunctions-daily"
        tags              = {
            "Component" = "Budget-Guardrails"
        }
        # (9 unchanged attributes hidden)

      - cost_filter {
          - name   = "LinkedAccount" -> null
          - values = [
              - "404584456509",
              - "982203978489",
            ] -> null
        }
      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "404584456509",
            ]
        }

        # (4 unchanged blocks hidden)
    }

  # module.cost_anomaly_detection[0].aws_ce_anomaly_monitor.main[0] will be created
  + resource "aws_ce_anomaly_monitor" "main" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + monitor_dimension = "SERVICE"
      + monitor_type      = "DIMENSIONAL"
      + name              = "ndx-cost-anomaly-monitor"
      + tags              = {
          + "Component" = "Cost-Anomaly-Detection"
          + "Name"      = "ndx-cost-anomaly-monitor"
        }
      + tags_all          = {
          + "Component"   = "Cost-Anomaly-Detection"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ndx-cost-anomaly-monitor"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
    }

  # module.cost_anomaly_detection[0].aws_ce_anomaly_subscription.high_priority[0] will be created
  + resource "aws_ce_anomaly_subscription" "high_priority" {
      + account_id       = (known after apply)
      + arn              = (known after apply)
      + frequency        = "IMMEDIATE"
      + id               = (known after apply)
      + monitor_arn_list = (known after apply)
      + name             = "ndx-high-priority-anomaly-subscription"
      + tags             = {
          + "Component" = "Cost-Anomaly-Detection"
          + "Name"      = "ndx-high-priority-anomaly-subscription"
        }
      + tags_all         = {
          + "Component"   = "Cost-Anomaly-Detection"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ndx-high-priority-anomaly-subscription"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }

      + subscriber {
          + address = "arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts"
          + type    = "SNS"
        }

      + threshold_expression {
          + dimension {
              + key           = "ANOMALY_TOTAL_IMPACT_ABSOLUTE"
              + match_options = [
                  + "GREATER_THAN_OR_EQUAL",
                ]
              + values        = [
                  + "50",
                ]
            }
        }
    }

  # module.cost_anomaly_detection[0].aws_ce_anomaly_subscription.main[0] will be created
  + resource "aws_ce_anomaly_subscription" "main" {
      + account_id       = (known after apply)
      + arn              = (known after apply)
      + frequency        = "DAILY"
      + id               = (known after apply)
      + monitor_arn_list = (known after apply)
      + name             = "ndx-cost-anomaly-subscription"
      + tags             = {
          + "Component" = "Cost-Anomaly-Detection"
          + "Name"      = "ndx-cost-anomaly-subscription"
        }
      + tags_all         = {
          + "Component"   = "Cost-Anomaly-Detection"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ndx-cost-anomaly-subscription"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }

      + subscriber {
          + address = "arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts"
          + type    = "SNS"
        }

      + threshold_expression {
          + dimension {
              + key           = "ANOMALY_TOTAL_IMPACT_ABSOLUTE"
              + match_options = [
                  + "GREATER_THAN_OR_EQUAL",
                ]
              + values        = [
                  + "10",
                ]
            }
        }
    }

  # module.dynamodb_billing_enforcer[0].aws_cloudwatch_event_target.invoke_enforcer_lambda will be created
  + resource "aws_cloudwatch_event_target" "invoke_enforcer_lambda" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "us-east-1"
      + rule           = "ndx-dynamodb-billing-enforcer"
      + target_id      = "InvokeEnforcerLambda"
    }

  # module.dynamodb_billing_enforcer[0].aws_cloudwatch_log_group.enforcer_lambda will be created
  + resource "aws_cloudwatch_log_group" "enforcer_lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/ndx-dynamodb-billing-enforcer"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + retention_in_days           = 7
      + skip_destroy                = false
      + tags                        = {
          + "Component" = "DynamoDB-Billing-Enforcer"
        }
      + tags_all                    = {
          + "Component"   = "DynamoDB-Billing-Enforcer"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
    }

  # module.dynamodb_billing_enforcer[0].aws_lambda_function.enforcer will be created
  + resource "aws_lambda_function" "enforcer" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/dynamodb-billing-enforcer/.lambda.zip"
      + function_name                  = "ndx-dynamodb-billing-enforcer"
      + handler                        = "index.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = "arn:aws:iam::955063685555:role/ndx-dynamodb-billing-enforcer"
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "MEh7ettZ0+Dp6ncALBl8kc2psX6x0oE6GWFipwyI1hk="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Component" = "DynamoDB-Billing-Enforcer"
        }
      + tags_all                       = {
          + "Component"   = "DynamoDB-Billing-Enforcer"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "EVENTBRIDGE_SOURCE"    = "ndx.dynamodb-billing-enforcer"
              + "EVENT_BUS_NAME"        = "default"
              + "EXEMPT_TABLE_PREFIXES" = ""
              + "SNS_TOPIC_ARN"         = "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts"
            }
        }
    }

  # module.dynamodb_billing_enforcer[0].aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "ndx-dynamodb-billing-enforcer"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "us-east-1"
      + source_arn          = "arn:aws:events:us-east-1:955063685555:rule/ndx-dynamodb-billing-enforcer"
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # module.scp_manager.aws_organizations_policy.cost_avoidance will be destroyed
  # (because aws_organizations_policy.cost_avoidance is not in configuration)
  - resource "aws_organizations_policy" "cost_avoidance" {
      - arn         = "arn:aws:organizations::955063685555:policy/o-4g8nrlnr9s/service_control_policy/p-ozmh7axs" -> null
      - content     = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ec2:RunInstances",
                        ]
                      - Condition = {
                          - ArnNotLike                  = {
                              - "aws:PrincipalARN" = [
                                  - "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  - "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  - "arn:aws:iam::*:role/stacksets-exec-*",
                                  - "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          - "ForAnyValue:StringNotLike" = {
                              - "ec2:InstanceType" = [
                                  - "t2.micro",
                                  - "t2.small",
                                  - "t2.medium",
                                  - "t3.micro",
                                  - "t3.small",
                                  - "t3.medium",
                                  - "t3.large",
                                  - "t3a.micro",
                                  - "t3a.small",
                                  - "t3a.medium",
                                  - "t3a.large",
                                  - "m5.large",
                                  - "m5.xlarge",
                                  - "m6i.large",
                                  - "m6i.xlarge",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Resource  = [
                          - "arn:aws:ec2:*:*:instance/*",
                        ]
                      - Sid       = "DenyLargeEC2Instances"
                    },
                  - {
                      - Action    = [
                          - "sagemaker:CreateEndpoint",
                          - "sagemaker:CreateEndpointConfig",
                          - "sagemaker:CreateTrainingJob",
                          - "sagemaker:CreateHyperParameterTuningJob",
                          - "elasticmapreduce:RunJobFlow",
                          - "gamelift:CreateFleet",
                          - "redshift:CreateCluster",
                        ]
                      - Condition = {
                          - ArnNotLike = {
                              - "aws:PrincipalARN" = [
                                  - "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  - "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  - "arn:aws:iam::*:role/stacksets-exec-*",
                                  - "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Resource  = [
                          - "*",
                        ]
                      - Sid       = "DenyExpensiveServices"
                    },
                  - {
                      - Action    = [
                          - "eks:CreateNodegroup",
                          - "eks:UpdateNodegroupConfig",
                        ]
                      - Condition = {
                          - ArnNotLike         = {
                              - "aws:PrincipalARN" = [
                                  - "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  - "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  - "arn:aws:iam::*:role/stacksets-exec-*",
                                  - "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          - NumericGreaterThan = {
                              - "eks:maxSize" = "5"
                            }
                        }
                      - Effect    = "Deny"
                      - Resource  = [
                          - "*",
                        ]
                      - Sid       = "LimitEKSNodegroupSize"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - description = "SCP to prevent runaway costs by limiting instance sizes and expensive operations. MANAGED BY TERRAFORM." -> null
      - id          = "p-ozmh7axs" -> null
      - name        = "InnovationSandboxCostAvoidanceScp" -> null
      - tags        = {
          - "Component" = "SCP-Overrides"
        } -> null
      - tags_all    = {
          - "Component"   = "SCP-Overrides"
          - "Environment" = "production"
          - "ManagedBy"   = "Terraform"
          - "Project"     = "NDX"
          - "Repository"  = "terraform-scp-overrides"
        } -> null
      - type        = "SERVICE_CONTROL_POLICY" -> null
    }

  # module.scp_manager.aws_organizations_policy.cost_avoidance_compute[0] will be created
  + resource "aws_organizations_policy" "cost_avoidance_compute" {
      + arn         = (known after apply)
      + content     = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ec2:RunInstances",
                        ]
                      + Condition = {
                          + ArnNotLike                  = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          + "ForAnyValue:StringNotLike" = {
                              + "ec2:InstanceType" = [
                                  + "t2.micro",
                                  + "t2.small",
                                  + "t2.medium",
                                  + "t3.micro",
                                  + "t3.small",
                                  + "t3.medium",
                                  + "t3.large",
                                  + "t3a.micro",
                                  + "t3a.small",
                                  + "t3a.medium",
                                  + "t3a.large",
                                  + "m5.large",
                                  + "m5.xlarge",
                                  + "m6i.large",
                                  + "m6i.xlarge",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:instance/*",
                        ]
                      + Sid       = "DenyUnallowedEC2"
                    },
                  + {
                      + Action    = [
                          + "ec2:RunInstances",
                        ]
                      + Condition = {
                          + ArnNotLike               = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          + "ForAnyValue:StringLike" = {
                              + "ec2:InstanceType" = [
                                  + "p*",
                                  + "g*",
                                  + "inf*",
                                  + "trn*",
                                  + "dl*",
                                  + "u-*",
                                  + "*.metal*",
                                  + "*.12xlarge",
                                  + "*.16xlarge",
                                  + "*.18xlarge",
                                  + "*.24xlarge",
                                  + "*.32xlarge",
                                  + "*.48xlarge",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:instance/*",
                        ]
                      + Sid       = "DenyExpensiveEC2"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                          + "ec2:RunInstances",
                        ]
                      + Condition = {
                          + ArnNotLike                 = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          + "ForAnyValue:StringEquals" = {
                              + "ec2:VolumeType" = [
                                  + "io1",
                                  + "io2",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:volume/*",
                        ]
                      + Sid       = "DenyExpensiveEBS"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                          + "ec2:RunInstances",
                        ]
                      + Condition = {
                          + ArnNotLike         = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          + NumericGreaterThan = {
                              + "ec2:VolumeSize" = "500"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:volume/*",
                        ]
                      + Sid       = "DenyLargeEBS"
                    },
                  + {
                      + Action    = [
                          + "rds:CreateDBInstance",
                          + "rds:CreateDBCluster",
                          + "rds:ModifyDBInstance",
                          + "rds:ModifyDBCluster",
                        ]
                      + Condition = {
                          + ArnNotLike                  = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          + "ForAnyValue:StringNotLike" = {
                              + "rds:DatabaseClass" = [
                                  + "db.t3.*",
                                  + "db.t4g.*",
                                  + "db.m5.large",
                                  + "db.m5.xlarge",
                                  + "db.m6g.large",
                                  + "db.m6g.xlarge",
                                  + "db.m6i.large",
                                  + "db.m6i.xlarge",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "*",
                        ]
                      + Sid       = "DenyUnallowedRDS"
                    },
                  + {
                      + Action    = [
                          + "rds:CreateDBInstance",
                          + "rds:ModifyDBInstance",
                        ]
                      + Condition = {
                          + ArnNotLike = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          + Bool       = {
                              + "rds:MultiAz" = "true"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "*",
                        ]
                      + Sid       = "DenyRDSMultiAZ"
                    },
                  + {
                      + Action    = [
                          + "elasticache:CreateCacheCluster",
                          + "elasticache:CreateReplicationGroup",
                        ]
                      + Condition = {
                          + ArnNotLike                              = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          + "ForAnyValue:StringNotEqualsIgnoreCase" = {
                              + "elasticache:CacheNodeType" = [
                                  + "cache.t3.*",
                                  + "cache.t4g.*",
                                  + "cache.m5.large",
                                  + "cache.m6g.large",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "*",
                        ]
                      + Sid       = "DenyUnallowedCache"
                    },
                  + {
                      + Action    = [
                          + "eks:CreateNodegroup",
                          + "eks:UpdateNodegroupConfig",
                        ]
                      + Condition = {
                          + ArnNotLike         = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          + NumericGreaterThan = {
                              + "eks:maxSize" = "5"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "*",
                        ]
                      + Sid       = "LimitEKSSize"
                    },
                  + {
                      + Action    = [
                          + "autoscaling:CreateAutoScalingGroup",
                          + "autoscaling:UpdateAutoScalingGroup",
                        ]
                      + Condition = {
                          + ArnNotLike         = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          + NumericGreaterThan = {
                              + "autoscaling:MaxSize" = "10"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "*",
                        ]
                      + Sid       = "LimitASGSize"
                    },
                  + {
                      + Action    = [
                          + "lambda:PutProvisionedConcurrencyConfig",
                        ]
                      + Condition = {
                          + ArnNotLike = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "*",
                        ]
                      + Sid       = "DenyLambdaPC"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + description = "Cost controls for compute: EC2, EBS, RDS, ElastiCache, EKS, ASG. MANAGED BY TERRAFORM."
      + id          = (known after apply)
      + name        = "InnovationSandboxCostAvoidanceComputeScp"
      + tags        = {
          + "Component" = "SCP-Overrides"
        }
      + tags_all    = {
          + "Component"   = "SCP-Overrides"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
      + type        = "SERVICE_CONTROL_POLICY"
    }

  # module.scp_manager.aws_organizations_policy.cost_avoidance_services[0] will be created
  + resource "aws_organizations_policy" "cost_avoidance_services" {
      + arn         = (known after apply)
      + content     = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sagemaker:CreateEndpoint",
                          + "sagemaker:CreateEndpointConfig",
                          + "sagemaker:CreateTrainingJob",
                          + "sagemaker:CreateHyperParameterTuningJob",
                        ]
                      + Effect   = "Deny"
                      + Resource = [
                          + "*",
                        ]
                      + Sid      = "DenyExpensiveML"
                    },
                  + {
                      + Action   = [
                          + "elasticmapreduce:RunJobFlow",
                          + "redshift:CreateCluster",
                          + "gamelift:CreateFleet",
                        ]
                      + Effect   = "Deny"
                      + Resource = [
                          + "*",
                        ]
                      + Sid      = "DenyExpensiveData"
                    },
                  + {
                      + Action   = [
                          + "kafka:Create*",
                          + "fsx:CreateFileSystem",
                          + "kinesis:CreateStream",
                          + "quicksight:*User",
                          + "ec2:AllocateDedicatedHosts",
                          + "ec2:PurchaseReserved*",
                          + "rds:PurchaseReserved*",
                          + "elasticache:PurchaseReserved*",
                          + "savingsplans:CreateSavingsPlan",
                          + "neptune:Create*",
                          + "docdb:Create*",
                          + "memorydb:CreateCluster",
                          + "es:Create*",
                          + "opensearch:Create*",
                          + "batch:CreateComputeEnvironment",
                          + "glue:CreateJob",
                          + "glue:CreateDevEndpoint",
                          + "elasticfilesystem:CreateFileSystem",
                          + "timestream:Create*",
                          + "qldb:CreateLedger",
                        ]
                      + Effect   = "Deny"
                      + Resource = [
                          + "*",
                        ]
                      + Sid      = "DenyExpensiveServices"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + description = "Block expensive services: SageMaker, EMR, Redshift, Neptune, etc. MANAGED BY TERRAFORM."
      + id          = (known after apply)
      + name        = "InnovationSandboxCostAvoidanceServicesScp"
      + tags        = {
          + "Component" = "SCP-Overrides"
        }
      + tags_all    = {
          + "Component"   = "SCP-Overrides"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
      + type        = "SERVICE_CONTROL_POLICY"
    }

  # module.scp_manager.aws_organizations_policy_attachment.cost_avoidance will be destroyed
  # (because aws_organizations_policy_attachment.cost_avoidance is not in configuration)
  - resource "aws_organizations_policy_attachment" "cost_avoidance" {
      - id        = "ou-2laj-sre4rnjs:p-ozmh7axs" -> null
      - policy_id = "p-ozmh7axs" -> null
      - target_id = "ou-2laj-sre4rnjs" -> null
    }

  # module.scp_manager.aws_organizations_policy_attachment.cost_avoidance_compute[0] will be created
  + resource "aws_organizations_policy_attachment" "cost_avoidance_compute" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "ou-2laj-sre4rnjs"
    }

  # module.scp_manager.aws_organizations_policy_attachment.cost_avoidance_services[0] will be created
  + resource "aws_organizations_policy_attachment" "cost_avoidance_services" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "ou-2laj-sre4rnjs"
    }

  # module.service_quotas.aws_servicequotas_template.apigateway_throttle_rate["us-east-1"] will be created
  + resource "aws_servicequotas_template" "apigateway_throttle_rate" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-8A5B8E40"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "apigateway"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 100
    }

  # module.service_quotas.aws_servicequotas_template.apigateway_throttle_rate["us-west-2"] will be created
  + resource "aws_servicequotas_template" "apigateway_throttle_rate" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-8A5B8E40"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "apigateway"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 100
    }

  # module.service_quotas.aws_servicequotas_template.bedrock_anthropic_tokens["us-east-1"] will be created
  + resource "aws_servicequotas_template" "bedrock_anthropic_tokens" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-F5FA8D9D"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "bedrock"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 5000
    }

  # module.service_quotas.aws_servicequotas_template.bedrock_anthropic_tokens["us-west-2"] will be created
  + resource "aws_servicequotas_template" "bedrock_anthropic_tokens" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-F5FA8D9D"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "bedrock"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 5000
    }

  # module.service_quotas.aws_servicequotas_template.cloudwatch_log_groups["us-east-1"] will be created
  + resource "aws_servicequotas_template" "cloudwatch_log_groups" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-D2832119"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "logs"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 50
    }

  # module.service_quotas.aws_servicequotas_template.cloudwatch_log_groups["us-west-2"] will be created
  + resource "aws_servicequotas_template" "cloudwatch_log_groups" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-D2832119"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "logs"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 50
    }

  # module.service_quotas.aws_servicequotas_template.dynamodb_read_capacity["us-east-1"] will be created
  + resource "aws_servicequotas_template" "dynamodb_read_capacity" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-8C6F19B1"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "dynamodb"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 1000
    }

  # module.service_quotas.aws_servicequotas_template.dynamodb_read_capacity["us-west-2"] will be created
  + resource "aws_servicequotas_template" "dynamodb_read_capacity" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-8C6F19B1"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "dynamodb"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 1000
    }

  # module.service_quotas.aws_servicequotas_template.dynamodb_table_count["us-east-1"] will be created
  + resource "aws_servicequotas_template" "dynamodb_table_count" {
      + aws_region   = "us-east-1"
      + g

... (truncated, see workflow logs for full output)
```

</details>

*Pushed by: @gjarzebak95, Action: `pull_request`*